/**
问题描述
小明为某机构设计了一个十字型的徽标（并非红十字会啊），如下所示：
..$$$$$$$$$$$$$..
..$...........$..
$$$.$$$$$$$$$.$$$
$...$.......$...$
$.$$$.$$$$$.$$$.$
$.$...$...$...$.$
$.$.$$$.$.$$$.$.$
$.$.$...$...$.$.$
$.$.$.$$$$$.$.$.$
$.$.$...$...$.$.$
$.$.$$$.$.$$$.$.$
$.$...$...$...$.$
$.$$$.$$$$$.$$$.$
$...$.......$...$
$$$.$$$$$$$$$.$$$
..$...........$..
..$$$$$$$$$$$$$.. 
对方同时也需要在电脑dos窗口中以字符的形式输出该标志，并能任意控制层数。
输入格式
一个正整数 n (n<30) 表示要求打印图形的层数。 
输出格式
对应包围层数的该标志。 
样例输入1
1 
样例输出1
..$$$$$..
..$...$..
$$$.$.$$$
$...$...$
$.$$$$$.$
$...$...$
$$$.$.$$$
..$...$..
..$$$$$.. 
样例输入2
3 
样例输出2
..$$$$$$$$$$$$$..
..$...........$..
$$$.$$$$$$$$$.$$$
$...$.......$...$
$.$$$.$$$$$.$$$.$
$.$...$...$...$.$
$.$.$$$.$.$$$.$.$
$.$.$...$...$.$.$
$.$.$.$$$$$.$.$.$
$.$.$...$...$.$.$
$.$.$$$.$.$$$.$.$
$.$...$...$...$.$
$.$$$.$$$$$.$$$.$
$...$.......$...$
$$$.$$$$$$$$$.$$$
..$...........$..
..$$$$$$$$$$$$$.. 
提示
请仔细观察样例，尤其要注意句点的数量和输出位置。 
 */
import java.util.Scanner;
public class Main {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int num = sc.nextInt();
        boolean[][] matrix = new boolean[num * 4 + 5][num * 4 + 5];

        for (int i = 0; i <= matrix.length / 2; i++) {
            for (int j = 0; j <= matrix[0].length / 2; j++) {
                if ((i % 2 == 0 || j % 2 == 0) && !(i % 2 == 1 && j > i + 1) && !(j % 2 == 1 && i > j + 1)) {
                    matrix[i][j] = true;
                } else {
                    if (i == j) {
                        matrix[i - 1][j] = false;
                        matrix[i][j - 1] = false;
                    }
                }
            }
        }
        matrix[0][0] = false;
        for (int i = 0; i <= matrix.length / 2; i++) {
            for (int j = 0; j <= matrix.length / 2; j++) {
                matrix[matrix.length - 1 - i][matrix.length - 1 - j] = matrix[i][j];
                matrix[i][matrix.length - 1 - j] = matrix[i][j];
                matrix[matrix.length - 1 - i][j] = matrix[i][j];
            }
        }

        for (int i = 0; i < matrix.length; i++) {
            for (int j = 0; j < matrix[0].length; j++) {
                System.out.print(matrix[i][j] ? '$' : '.');
            }
            System.out.println("");
        }

    }
}
